Show / Hide Table of Contents
Class IdeaConImportSettings
Represents settings of improt options into Idea Connections
Inheritance
System.Object
IdeaConImportSettings
IdeaSMemberImportSettings
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class IdeaConImportSettings
Constructors
Improve this Doc   View Source
IdeaConImportSettings()
Constructor - it sets default values
Declaration
public IdeaConImportSettings()
Properties
Improve this Doc   View Source
CanChangeDesignCodeInWizard
Can change design code in Wizard
Declaration
public bool CanChangeDesignCodeInWizard { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
ConnectionFileName
Gets or sets the name of the Connection project
Declaration
public string ConnectionFileName { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
DefaultBoltAssembly
Gets or sets the name of the default bolt assembly
Declaration
public string DefaultBoltAssembly { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
DefaultSteelMaterial
Gets or sets the name of the default material of plates which are added from the template
Declaration
public string DefaultSteelMaterial { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
DefaultWeldMaterial
Gets or sets the name of the default weld material
Declaration
public string DefaultWeldMaterial { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
DesignCode
Gets or sets the Design Code There can be : ECEN AISC CISC RUS
Declaration
public string DesignCode { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
ExportAllLinearCombination
All linear combination will be exported to IDEA connection
Declaration
public bool ExportAllLinearCombination { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
OnePageWizard
One page wizard
Declaration
public bool OnePageWizard { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
OrderMembersById
If true, connected members in connection are ordered acoording to topological rules othewise by their IDs.
Declaration
public bool OrderMembersById { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
ProjectDescription
Description
Declaration
public string ProjectDescription { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
ProjectName
Name
Declaration
public string ProjectName { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
RunningApplication
Running application
Declaration
public string RunningApplication { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
StartIdeaStaticaApp
StartIdeaStaticaApp
Declaration
public bool StartIdeaStaticaApp { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
UserWizardBrand
Set user Wizard Brand
Declaration
public string UserWizardBrand { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
UseWizard
Open import wizard window
Declaration
public bool UseWizard { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
WaitForExit
WaitForExit
Declaration
public bool WaitForExit { get; set; }
Property Value
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source